InformationRegisters/СведенияОСообщенияхОбменаСМобильнымиКлиентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>СведенияОСообщенияхОбменаСМобильнымиКлиентами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПередачиКлиенту</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяФормирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяПодготовки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеобходимоПодготовитьОтвет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СообщенияИнтегрированныхСистем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СведенияОСообщенияхОбменаСМобильнымиКлиентами/Ext/ManagerModule.bsl
// Записывает сведения о сообщении обмена с мобильным клиентом
// Параметры:
//	Сообщение - ссылка на СообщениеИнтегрированныхСистем
//	РазмерСообщения - размер сообщения в байтах
//	КоличествоДанных - количество объектов данных, помещенных в сообщение
Процедура ЗаписатьСведения(Сообщение, РазмерСообщения, КоличествоДанных) Экспорт
	
	Запись = РегистрыСведений.СведенияОСообщенияхОбменаСМобильнымиКлиентами.СоздатьМенеджерЗаписи();
	Запись.Сообщение = Сообщение;
	Запись.Прочитать();
	Запись.Сообщение = Сообщение;
	Запись.РазмерСообщения = РазмерСообщения;
	Запись.КоличествоДанных = КоличествоДанных;
	Запись.Записать();
	
КонецПроцедуры

// Записывает время формирования сообщения обмена с мобильным клиентом
// Параметры:
//	Сообщение - ссылка на СообщениеИнтегрированныхСистем
//	ВремяФормирования - время формирования в секундах
Процедура ЗаписатьВремяФормирования(Сообщение, ВремяФормирования) Экспорт
	
	Запись = РегистрыСведений.СведенияОСообщенияхОбменаСМобильнымиКлиентами.СоздатьМенеджерЗаписи();
	Запись.Сообщение = Сообщение;
	Запись.Прочитать();
	Запись.Сообщение = Сообщение;
	Запись.ВремяФормирования = ВремяФормирования;
	Запись.Записать();
	
КонецПроцедуры

// Записывает время подготовки сообщения обмена с мобильным клиентом
// Параметры:
//	Сообщение - ссылка на СообщениеИнтегрированныхСистем
//	ВремяПодготовки - время формирования в секундах
Процедура ЗаписатьВремяПодготовки(Сообщение, ВремяПодготовки) Экспорт
	
	Запись = РегистрыСведений.СведенияОСообщенияхОбменаСМобильнымиКлиентами.СоздатьМенеджерЗаписи();
	Запись.Сообщение = Сообщение;
	Запись.Прочитать();
	Запись.Сообщение = Сообщение;
	Запись.ВремяПодготовки = ВремяПодготовки;
	Запись.Записать();
	
КонецПроцедуры

// Записывает дату окончания передачи сообщения клиенту
// Параметры:
//	Сообщение - ссылка на СообщениеИнтегрированныхСистем
//	ДатаПередачиКлиенту - дата окончания передачи сообщения клиенту
Процедура ЗаписатьДатуПередачиКлиенту(Сообщение, ДатаПередачиКлиенту) Экспорт
	
	Запись = РегистрыСведений.СведенияОСообщенияхОбменаСМобильнымиКлиентами.СоздатьМенеджерЗаписи();
	Запись.Сообщение = Сообщение;
	Запись.Прочитать();
	Запись.Сообщение = Сообщение;
	Запись.ДатаПередачиКлиенту = ДатаПередачиКлиенту;
	Запись.Записать();
	
КонецПроцедуры

Процедура ЗаписатьНеобходимостьОтвета(Сообщение, НеобходимОтвет) Экспорт
	
	Запись = РегистрыСведений.СведенияОСообщенияхОбменаСМобильнымиКлиентами.СоздатьМенеджерЗаписи();
	Запись.Сообщение = Сообщение;
	Запись.Прочитать();
	Запись.Сообщение = Сообщение;
	Запись.НеобходимоПодготовитьОтвет = НеобходимОтвет;
	Запись.Записать();
	
КонецПроцедуры

Процедура ЗаписатьРазмер(Сообщение, Размер) Экспорт
	
	Запись = РегистрыСведений.СведенияОСообщенияхОбменаСМобильнымиКлиентами.СоздатьМенеджерЗаписи();
	Запись.Сообщение = Сообщение;
	Запись.Прочитать();
	Запись.Сообщение = Сообщение;
	Запись.РазмерСообщения = Размер;
	Запись.Записать();
	
КонецПроцедуры

// Возвращает все сведения о сообщении
// Параметры:
//	Сообщение - ссылка на СообщениеИнтегрированныхСистем
Функция ПолучитьСведения(Сообщение) Экспорт
	
	Запись = РегистрыСведений.СведенияОСообщенияхОбменаСМобильнымиКлиентами.СоздатьМенеджерЗаписи();
	Запись.Сообщение = Сообщение;
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("РазмерСообщения", Запись.РазмерСообщения);
	Результат.Вставить("КоличествоДанных", Запись.КоличествоДанных);
	Результат.Вставить("ДатаПередачиКлиенту", Запись.ДатаПередачиКлиенту);
	Результат.Вставить("ДатаФормирования", Запись.ДатаФормирования);
	Результат.Вставить("ВремяПодготовки", Запись.ВремяПодготовки);
	Результат.Вставить("НеобходимоПодготовитьОтвет", Запись.НеобходимоПодготовитьОтвет);
	Возврат Результат;
	
КонецФункции
